*** Do the initial processing of the data
Imports the data and runs it through initial edgeR analysis using the functions created above
#+begin_src jupyter-R :session R
a <- txi(directory, quantdatafoldername, "metadata.csv", fishtype)
#De <- initialDeseq(a[[1]], a[[2]])
Ed <- initialEdgeR(a[[1]], a[[2]])
Eest <- estEdgeR(Ed[[1]], Ed[[2]])
lrt <- glmLRT(Eest, coef=1:4)
test <- glmQLFTest(Eest, coef=1:4)
#+end_src

#+RESULTS:
#+begin_example
reading in files with read_tsv

1 
2 
3 
4 
5 
6 
7 
8 
9 
10 
11 
12 
13 
14 
15 
16 
17 


summarizing abundance

summarizing counts

summarizing length

Loading required package: limma
#+end_example

*** Save the data tables to a file
Configure this to fit your computer
#+begin_src jupyter-R :session R
setwd("/home/david/Documents/BenoitLab/RNA-seq/")
write.table(table, file="edgeR-Genes/TotalExpr.csv", quote=FALSE, col.names=TRUE, row.names=TRUE, sep=",")
write.table(leg, file="edgeR-Genes/legExpr.csv", quote=FALSE, col.names=TRUE, row.names=TRUE, sep=",")
write.table(body, file="edgeR-Genes/bodyExpr.csv", quote=FALSE, col.names=TRUE, row.names=TRUE, sep=",")
#+end_src

#+RESULTS:
:RESULTS:
# [goto error]
: Error in as.data.frame.default(x[[i]], optional = TRUE): cannot coerce class ‘"function"’ to a data.frame
: Traceback:
:
: 1. write.table(table, file = "edgeR-Genes/TotalExpr.csv", quote = FALSE,
:  .     col.names = TRUE, row.names = TRUE, sep = ",")
: 2. data.frame(x)
: 3. as.data.frame(x[[i]], optional = TRUE)
: 4. as.data.frame.default(x[[i]], optional = TRUE)
: 5. stop(gettextf("cannot coerce class %s to a data.frame", sQuote(deparse(class(x))[1L])),
:  .     domain = NA)
:END:

